byYorick/mesh_hydro/node_ph_ec/sdkconfig.defaults
# NODE pH/EC Configuration

# ESP32-S3 Target
CONFIG_IDF_TARGET="esp32s3"

# ESP-WIFI-MESH (NODE режим)
CONFIG_ESP_WIFI_MESH_SUPPORT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Memory
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_MAIN_TASK_STACK_SIZE=8192

# I2C для датчиков и OLED
CONFIG_I2C_ENABLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table (для OTA)
CONFIG_PARTITION_TABLE_TWO_OTA=y

